from celery import shared_task
from django.core.files import File
from apps.rosstat_parser.models import Region
from apps.rosstat_parser.api.v1.services.excel_writer import create_all_tables
from apps.rosstat_parser.api.v1.services.downloader import download_rosstat_tables


REGIONS = [
        "Республика Адыгея",
        "Республика Алтай",
        "Республика Башкортостан",
        "Республика Бурятия",
        "Республика Дагестан",
        "Республика Ингушетия",
        "Кабардино-Балкарская Республика",
        "Республика Калмыкия",
        "Карачаево-Черкесская Республика",
        "Республика Карелия",
        "Республика Коми",
        "Республика Крым",
        "Республика Марий Эл",
        "Республика Мордовия",
        "Республика Саха (Якутия)",
        "Республика Северная Осетия - Алания",
        "Республика Татарстан",
        "Республика Тыва",
        "Удмуртская Республика",
        "Республика Хакасия",
        "Чеченская Республика",
        "Чувашская Республика",
        "Алтайский край",
        "Забайкальский край",
        "Камчатский край",
        "Краснодарский край",
        "Красноярский край",
        "Пермский край",
        "Приморский край",
        "Ставропольский край",
        "Хабаровский край",
        "Амурская область",
        "Архангельская область",
        "Астраханская область",
        "Белгородская область",
        "Брянская область",
        "Владимирская область",
        "Волгоградская область",
        "Вологодская область",
        "Воронежская область",
        "Ивановская область",
        "Иркутская область",
        "Калининградская область",
        "Калужская область",
        "Кемеровская область - Кузбасс",
        "Кировская область",
        "Костромская область",
        "Курганская область",
        "Курская область",
        "Ленинградская область",
        "Липецкая область",
        "Магаданская область",
        "Московская область",
        "Мурманская область",
        "Нижегородская область",
        "Новгородская область",
        "Новосибирская область",
        "Омская область",
        "Оренбургская область",
        "Орловская область",
        "Пензенская область",
        "Псковская область",
        "Ростовская область",
        "Рязанская область",
        "Самарская область",
        "Саратовская область",
        "Сахалинская область",
        "Свердловская область",
        "Смоленская область",
        "Тамбовская область",
        "Тверская область",
        "Томская область",
        "Тульская область",
        "Тюменская область",
        "Ульяновская область",
        "Челябинская область",
        "Ярославская область",
        "г.Москва",
        "г.Санкт-Петербург",
        "г.Севастополь",
        "Еврейская автономная область",
        "Ненецкий автономный округ",
        "Ханты-Мансийский автономный округ - Югра",
        "Чукотский автономный округ",
        "Ямало-Ненецкий автономный округ",
        "Тюменская область (кроме Ханты-Мансийского автономного округа-Югры и Ямало-Ненецкого автономного округа)",
    ]

@shared_task
def create_region_table():
    Region.objects.all().delete()
    download_rosstat_tables(save_dir="downloads")

    for region in REGIONS:
        print(region)
        create_all_tables(region)

        file_path = f"tables/Аналитические таблицы {region}.xlsx"
        region_obj = Region.objects.create(name=region)

        with open(file_path, "rb") as f:
            region_obj.analytical_table.save(
                f"Аналитические таблицы {region}.xlsx",
                File(f)
            )

            region_obj.save()

    return True
